Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedMemberLoad.EndValue Property
 Gets or sets the end value of the decomposed member load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double EndValue { get; set; }
Public Property EndValue As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisDecomposedMemberLoad Class
Tekla.Structures.Analysis Namespace